export default {
    "あ": "a", "い": "i", "う": "u", "え": "e", "お": "o",
    "ア": "a", "イ": "i", "ウ": "u", "エ": "e", "オ": "o",

    "か": "ka", "き": "ki", "く": "ku", "け": "ke", "こ": "ko",
    "カ": "ka", "キ": "ki", "ク": "ku", "ケ": "ke", "コ": "ko",

    "さ": "sa", "し": "shi", "す": "su", "せ": "se", "そ": "so",
    "サ": "sa", "シ": "shi", "ス": "su", "セ": "se", "ソ": "so",

    "た": "ta", "ち": "chi", "つ": "tsu", "て": "te", "と": "to",
    "タ": "ta", "チ": "chi", "ツ": "tsu", "テ": "te", "ト": "to",

    "な": "na", "に": "ni", "ぬ": "nu", "ね": "ne", "の": "no",
    "ナ": "na", "ニ": "ni", "ヌ": "nu", "ネ": "ne", "ノ": "no",

    "は": "ha", "ひ": "hi", "ふ": "fu", "へ": "he", "ほ": "ho",
    "ハ": "ha", "ヒ": "hi", "フ": "fu", "ヘ": "he", "ホ": "ho",

    "ま": "ma", "み": "mi", "む": "mu", "め": "me", "も": "mo",
    "マ": "ma", "ミ": "mi", "ム": "mu", "メ": "me", "モ": "mo",

    "ら": "ra", "り": "ri", "る": "ru", "れ": "re", "ろ": "ro",
    "ラ": "ra", "リ": "ri", "ル": "ru", "レ": "re", "ロ": "ro",

    "や": "ya", "ゆ": "yu", "よ": "yo",
    "ヤ": "ya", "ユ": "yu", "ヨ": "yo",

    "わ": "wa", "を": ["o", "wo"], "ん": "n",
    "ワ": "wa", "ヲ": ["o", "wo"], "ン": "n",

    //tenten
    "が": "ga", "ぎ": "gi", "ぐ": "gu", "げ": "ge", "ご": "go",
    "ガ": "ga", "ギ": "gi", "グ": "gu", "ゲ": "ge", "ゴ": "go",

    "ざ": "za", "じ": ["zi", "ji"], "ず": "zu", "ぜ": "ze", "ぞ": "zo",
    "ザ": "za", "ジ": ["zi", "ji"], "ズ": "zu", "ゼ": "ze", "ゾ": "zo",

    "だ": "da", "ぢ": ["di", "ji", "dji", "dzi"], "づ": ["zu", "dzu", "du"], "で": "de", "ど": "do",
    "ダ": "da", "ヂ": ["di", "ji", "dji", "dzi"], "ヅ": ["zu", "dzu", "du"], "デ": "de", "ド": "do",

    "ば": "ba", "び": "bi", "ぶ": "bu", "べ": "be", "ぼ": "bo",
    "バ": "ba", "ビ": "bi", "ブ": "bu", "ベ": "be", "ボ": "bo",

    //maru
    "ぱ": "pa", "ぴ": "pi", "ぷ": "pu", "ぺ": "pe", "ぽ": "po",
    "パ": "pa", "ピ": "pi", "プ": "pu", "ペ": "pe", "ポ": "po",

    // Combined readings
    // ya
    "ひゃ": "hya", "ヒャ": "hya",
    "きゃ": "kya", "キャ": "kya",
    "ぎゃ": "gya", "ギャ": "gya",
    "にゃ": "nya", "ニャ": "nya",
    "みゃ": "mya", "ミャ": "mya",
    "りゃ": "rya", "リャ": "rya",
    "しゃ": ["sya", "sha"], "シャ": ["sya", "sha"],
    "ちゃ": ["tya", "cha"], "チャ": ["tya", "cha"],
    "じゃ": ["zya", "ja", "jya"], "ジャ": ["zya", "ja", "jya"],
    "ぢゃ": ["dya", "ja", "dja"], "ヂャ": ["dya", "ja", "dja"],
    "びゃ": "bya", "ビャ": "bya",
    "ぴゃ": "pya", "ピャ": "pya",

    // yu
    "ひゅ": "hyu", "ヒュ": "hyu",
    "ぢゅ": ["dyu", "ju", "dju"], "ヂュ": ["dyu", "ju", "dju"],
    "きゅ": "kyu", "キュ": "kyu",
    "しゅ": ["syu", "shu"], "シュ": ["syu", "shu"],
    "じゅ": ["zyu", "ju", "jyu"], "ジュ": ["zyu", "ju", "jyu"],
    "りゅ": "ryu", "リュ": "ryu",
    "にゅ": "nyu", "ニュ": "nyu",
    "みゅ": "myu", "ミュ": "myu",
    "ぎゅ": "gyu", "ギュ": "gyu",
    "びゅ": "byu", "ビュ": "byu",
    "ぴゅ": "pyu", "ピュ": "pyu",
    "ちゅ": ["tyu", "chu"], "チュ": ["tyu", "chu"],

    // yo
    "きょ": "kyo", "キョ": "kyo",
    "しょ": ["syo", "sho"], "ショ": ["syo", "sho"],
    "じょ": ["zyo", "jo", "jyo"], "ジョ": ["zyo", "jo", "jyo"],
    "りょ": "ryo", "リョ": "ryo",
    "ちょ": ["cho", "tyo"], "チョ": ["cho", "tyo"],
    "ぢょ": ["dyo", "jo", "djo"], "ヂョ": ["dyo", "jo", "djo"],
    "ひょ": "hyo", "ヒョ": "hyo",
    "みょ": "myo", "ミョ": "myo",
    "にょ": "nyo", "ニョ": "nyo",
    "ぎょ": "gyo", "ギョ": "gyo",
    "びょ": "byo", "ビョ": "byo",
    "ぴょ": "pyo", "ピョ": "pyo",

    // Advanced/rarer readings
    "ファ": "fa", "フィ": "fi", "フェ": "fe", "フォ ": "fo",
    "ツァ": "tsa", "ティ": "ti", "トゥ": "tu",
    "ウェ": "we", "ウォ": "wo"
  }
